# ImageFormat Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DWFExportOptions..::..ImageFormat Property
DWFExportOptions Class See Also
---
Controls the compression level of images embedded.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public DWFImageFormat ImageFormat { get; set; }
```

Visual Basic
---
```text
Public Property ImageFormat As DWFImageFormat
	Get
	Set
```

Visual C++
---
```text
public:
property DWFImageFormat ImageFormat {
	DWFImageFormat get ();
	void set (DWFImageFormat value);
}
```

# Remarks
ImageQuality is ignored when ImageFormat is set to "PNG"-the standard format.
# See Also
DWFExportOptions Class
Autodesk.Revit.DB Namespace